#Задача E: Генерація масиву

# Оголошення фунції-генератора, яка генерує послідовність за заданою формулою 
def sequence_generator(a):
    value = a # Початкове значення
    while True: # Нескінченний цикл для генерації послідовності
        yield value # Повертаємо поточне значення
        # Обчислюємо наступного елементу за формулою
        value = (value * value) % 100 - 5 * value + 6 
        
 # Зчитуємо початкове значення
a = int(input())
gen = sequence_generator(a) # Створюємо генератор з початковим значенням a
# Отримвння перших 10 елементів послідовності
result = [next(gen) for _ in range(10)]
print(*result) # Виводимо елементи через пробіл



